Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا
en: Say, "Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names." And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.

source: وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن له ولي من الذل وكبره تكبيرا
en: And say, "Praise to Allah, who has not taken a son and has had no partner in [His] dominion and has no [need of a] protector out of weakness; and glorify Him with [great] glorification."

source: الحمد لله الذي أنزل على عبده الكتاب ولم يجعل له عوجا
en: [All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance.

source: قيما لينذر بأسا شديدا من لدنه ويبشر المؤمنين الذين يعملون الصالحات أن لهم أجرا حسنا
en: [He has made it] straight, to warn of severe punishment from Him and to give good tidings to the believers who do righteous deeds that they will have a good reward

source: ماكثين فيه أبدا
en: In which they will remain forever

source: وينذر الذين قالوا اتخذ الله ولدا
en: And to warn those who say, "Allah has taken a son."

source: ما لهم به من علم ولا لآبائهم كبرت كلمة تخرج من أفواههم إن يقولون إلا كذبا
en: They have no knowledge of it, nor had their fathers. Grave is the word that comes out of their mouths; they speak not except a lie.

source: فلعلك باخع نفسك على آثارهم إن لم يؤمنوا بهذا الحديث أسفا
en: Then perhaps you would kill yourself through grief over them, [O Muhammad], if they do not believe in this message, [and] out of sorrow.

source: إنا جعلنا ما على الأرض زينة لها لنبلوهم أيهم أحسن عملا
en: Indeed, We have made that which is on the earth adornment for it that We may test them [as to] which of them is best in deed.

source: وإنا لجاعلون ما عليها صعيدا جرزا
en: And indeed, We will make that which is upon it [into] a barren ground.

source: أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجبا
en: Or have you thought that the companions of the cave and the inscription were, among Our signs, a wonder?

source: إذ أوى الفتية إلى الكهف فقالوا ربنا آتنا من لدنك رحمة وهيئ لنا من أمرنا رشدا
en: [Mention] when the youths retreated to the cave and said, "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance."

source: فضربنا على آذانهم في الكهف سنين عددا
en: So We cast [a cover of sleep] over their ears within the cave for a number of years.

source: ثم بعثناهم لنعلم أي الحزبين أحصى لما لبثوا أمدا
en: Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.

source: نحن نقص عليك نبأهم بالحق إنهم فتية آمنوا بربهم وزدناهم هدى
en: It is We who relate to you, [O Muhammad], their story in truth. Indeed, they were youths who believed in their Lord, and We increased them in guidance.

source: وربطنا على قلوبهم إذ قاموا فقالوا ربنا رب السماوات والأرض لن ندعو من دونه إلها لقد قلنا إذا شططا
en: And We made firm their hearts when they stood up and said, "Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.

source: هؤلاء قومنا اتخذوا من دونه آلهة لولا يأتون عليهم بسلطان بين فمن أظلم ممن افترى على الله كذبا
en: These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear authority? And who is more unjust than one who invents about Allah a lie?"

source: وإذ اعتزلتموهم وما يعبدون إلا الله فأووا إلى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من أمركم مرفقا
en: [The youths said to one another], "And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility."

source: وترى الشمس إذا طلعت تزاور عن كهفهم ذات اليمين وإذا غربت تقرضهم ذات الشمال وهم في فجوة منه ذلك من آيات الله من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا
en: And [had you been present], you would see the sun when it rose, inclining away from their cave on the right, and when it set, passing away from them on the left, while they were [laying] within an open space thereof. That was from the signs of Allah. He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide.

source: وتحسبهم أيقاظا وهم رقود ونقلبهم ذات اليمين وذات الشمال وكلبهم باسط ذراعيه بالوصيد لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا
en: And you would think them awake, while they were asleep. And We turned them to the right and to the left, while their dog stretched his forelegs at the entrance. If you had looked at them, you would have turned from them in flight and been filled by them with terror.

source: وكذلك بعثناهم ليتساءلوا بينهم قال قائل منهم كم لبثتم قالوا لبثنا يوما أو بعض يوم قالوا ربكم أعلم بما لبثتم فابعثوا أحدكم بورقكم هذه إلى المدينة فلينظر أيها أزكى طعاما فليأتكم برزق منه وليتلطف ولا يشعرن بكم أحدا
en: And similarly, We awakened them that they might question one another. Said a speaker from among them, "How long have you remained [here]?" They said, "We have remained a day or part of a day." They said, "Your Lord is most knowing of how long you remained. So send one of you with this silver coin of yours to the city and let him look to which is the best of food and bring you provision from it and let him be cautious. And let no one be aware of you.

source: إنهم إن يظهروا عليكم يرجموكم أو يعيدوكم في ملتهم ولن تفلحوا إذا أبدا
en: Indeed, if they come to know of you, they will stone you or return you to their religion. And never would you succeed, then - ever."

source: وكذلك أعثرنا عليهم ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا
en: And similarly, We caused them to be found that they [who found them] would know that the promise of Allah is truth and that of the Hour there is no doubt. [That was] when they disputed among themselves about their affair and [then] said, "Construct over them a structure. Their Lord is most knowing about them." Said those who prevailed in the matter, "We will surely take [for ourselves] over them a masjid."

source: سيقولون ثلاثة رابعهم كلبهم ويقولون خمسة سادسهم كلبهم رجما بالغيب ويقولون سبعة وثامنهم كلبهم قل ربي أعلم بعدتهم ما يعلمهم إلا قليل فلا تمار فيهم إلا مراء ظاهرا ولا تستفت فيهم منهم أحدا
en: They will say there were three, the fourth of them being their dog; and they will say there were five, the sixth of them being their dog - guessing at the unseen; and they will say there were seven, and the eighth of them was their dog. Say, [O Muhammad], "My Lord is most knowing of their number. None knows them except a few. So do not argue about them except with an obvious argument and do not inquire about them among [the speculators] from anyone."

source: ولا تقولن لشيء إني فاعل ذلك غدا
en: And never say of anything, "Indeed, I will do that tomorrow,"

source: إلا أن يشاء الله واذكر ربك إذا نسيت وقل عسى أن يهدين ربي لأقرب من هذا رشدا
en: Except [when adding], "If Allah wills." And remember your Lord when you forget [it] and say, "Perhaps my Lord will guide me to what is nearer than this to right conduct."

source: ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا
en: And they remained in their cave for three hundred years and exceeded by nine.

source: قل الله أعلم بما لبثوا له غيب السماوات والأرض أبصر به وأسمع ما لهم من دونه من ولي ولا يشرك في حكمه أحدا
en: Say, "Allah is most knowing of how long they remained. He has [knowledge of] the unseen [aspects] of the heavens and the earth. How Seeing is He and how Hearing! They have not besides Him any protector, and He shares not His legislation with anyone."

source: واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته ولن تجد من دونه ملتحدا
en: And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.

source: واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا واتبع هواه وكان أمره فرطا
en: And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His countenance. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect.

source: وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر إنا أعتدنا للظالمين نارا أحاط بهم سرادقها وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا
en: And say, "The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve." Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like murky oil, which scalds [their] faces. Wretched is the drink, and evil is the resting place.

source: إن الذين آمنوا وعملوا الصالحات إنا لا نضيع أجر من أحسن عملا
en: Indeed, those who have believed and done righteous deeds - indeed, We will not allow to be lost the reward of any who did well in deeds.

source: أولئك لهم جنات عدن تجري من تحتهم الأنهار يحلون فيها من أساور من ذهب ويلبسون ثيابا خضرا من سندس وإستبرق متكئين فيها على الأرائك نعم الثواب وحسنت مرتفقا
en: Those will have gardens of perpetual residence; beneath them rivers will flow. They will be adorned therein with bracelets of gold and will wear green garments of fine silk and brocade, reclining therein on adorned couches. Excellent is the reward, and good is the resting place.

source: واضرب لهم مثلا رجلين جعلنا لأحدهما جنتين من أعناب وحففناهما بنخل وجعلنا بينهما زرعا
en: And present to them an example of two men: We granted to one of them two gardens of grapevines, and We bordered them with palm trees and placed between them [fields of] crops.

source: كلتا الجنتين آتت أكلها ولم تظلم منه شيئا وفجرنا خلالهما نهرا
en: Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.

source: وكان له ثمر فقال لصاحبه وهو يحاوره أنا أكثر منك مالا وأعز نفرا
en: And he had fruit, so he said to his companion while he was conversing with him, "I am greater than you in wealth and mightier in [numbers of] men."

source: ودخل جنته وهو ظالم لنفسه قال ما أظن أن تبيد هذه أبدا
en: And he entered his garden while he was unjust to himself. He said, "I do not think that this will perish - ever.

source: وما أظن الساعة قائمة ولئن رددت إلى ربي لأجدن خيرا منها منقلبا
en: And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return."

source: قال له صاحبه وهو يحاوره أكفرت بالذي خلقك من تراب ثم من نطفة ثم سواك رجلا
en: His companion said to him while he was conversing with him, "Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man?

source: لكنا هو الله ربي ولا أشرك بربي أحدا
en: But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.

source: ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله إن ترن أنا أقل منك مالا وولدا
en: And why did you, when you entered your garden, not say, 'What Allah willed [has occurred]; there is no power except in Allah '? Although you see me less than you in wealth and children,

source: فعسى ربي أن يؤتين خيرا من جنتك ويرسل عليها حسبانا من السماء فتصبح صعيدا زلقا
en: It may be that my Lord will give me [something] better than your garden and will send upon it a calamity from the sky, and it will become a smooth, dusty ground,

source: أو يصبح ماؤها غورا فلن تستطيع له طلبا
en: Or its water will become sunken [into the earth], so you would never be able to seek it."

source: وأحيط بثمره فأصبح يقلب كفيه على ما أنفق فيها وهي خاوية على عروشها ويقول يا ليتني لم أشرك بربي أحدا
en: And his fruits were encompassed [by ruin], so he began to turn his hands about [in dismay] over what he had spent on it, while it had collapsed upon its trellises, and said, "Oh, I wish I had not associated with my Lord anyone."

source: ولم تكن له فئة ينصرونه من دون الله وما كان منتصرا
en: And there was for him no company to aid him other than Allah, nor could he defend himself.

source: هنالك الولاية لله الحق هو خير ثوابا وخير عقبا
en: There the authority is [completely] for Allah, the Truth. He is best in reward and best in outcome.

source: واضرب لهم مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض فأصبح هشيما تذروه الرياح وكان الله على كل شيء مقتدرا
en: And present to them the example of the life of this world, [its being] like rain which We send down from the sky, and the vegetation of the earth mingles with it and [then] it becomes dry remnants, scattered by the winds. And Allah is ever, over all things, Perfect in Ability.

source: المال والبنون زينة الحياة الدنيا والباقيات الصالحات خير عند ربك ثوابا وخير أملا
en: Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope.

source: ويوم نسير الجبال وترى الأرض بارزة وحشرناهم فلم نغادر منهم أحدا
en: And [warn of] the Day when We will remove the mountains and you will see the earth prominent, and We will gather them and not leave behind from them anyone.

source: وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة بل زعمتم ألن نجعل لكم موعدا
en: And they will be presented before your Lord in rows, [and He will say], "You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment."

source: ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا مال هذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا
en: And the record [of deeds] will be placed [open], and you will see the criminals fearful of that within it, and they will say, "Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?" And they will find what they did present [before them]. And your Lord does injustice to no one.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس كان من الجن ففسق عن أمر ربه أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا
en: And [mention] when We said to the angels, "Prostrate to Adam," and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange.

source: ما أشهدتهم خلق السماوات والأرض ولا خلق أنفسهم وما كنت متخذ المضلين عضدا
en: I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.

source: ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا
en: And [warn of] the Day when He will say, "Call 'My partners' whom you claimed," and they will invoke them, but they will not respond to them. And We will put between them [a valley of] destruction.

source: ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا
en: And the criminals will see the Fire and will be certain that they are to fall therein. And they will not find from it a way elsewhere.

source: ولقد صرفنا في هذا القرآن للناس من كل مثل وكان الإنسان أكثر شيء جدلا
en: And We have certainly diversified in this Qur'an for the people from every [kind of] example; but man has ever been, most of anything, [prone to] dispute.

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى ويستغفروا ربهم إلا أن تأتيهم سنة الأولين أو يأتيهم العذاب قبلا
en: And nothing has prevented the people from believing when guidance came to them and from asking forgiveness of their Lord except that there [must] befall them the [accustomed] precedent of the former peoples or that the punishment should come [directly] before them.

source: وما نرسل المرسلين إلا مبشرين ومنذرين ويجادل الذين كفروا بالباطل ليدحضوا به الحق واتخذوا آياتي وما أنذروا هزوا
en: And We send not the messengers except as bringers of good tidings and warners. And those who disbelieve dispute by [using] falsehood to [attempt to] invalidate thereby the truth and have taken My verses, and that of which they are warned, in ridicule.

source: ومن أظلم ممن ذكر بآيات ربه فأعرض عنها ونسي ما قدمت يداه إنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن تدعهم إلى الهدى فلن يهتدوا إذا أبدا
en: And who is more unjust than one who is reminded of the verses of his Lord but turns away from them and forgets what his hands have put forth? Indeed, We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if you invite them to guidance - they will never be guided, then - ever.

source: وربك الغفور ذو الرحمة لو يؤاخذهم بما كسبوا لعجل لهم العذاب بل لهم موعد لن يجدوا من دونه موئلا
en: And your Lord is the Forgiving, full of mercy. If He were to impose blame upon them for what they earned, He would have hastened for them the punishment. Rather, for them is an appointment from which they will never find an escape.

source: وتلك القرى أهلكناهم لما ظلموا وجعلنا لمهلكهم موعدا
en: And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.

source: وإذ قال موسى لفتاه لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا
en: And [mention] when Moses said to his servant, "I will not cease [traveling] until I reach the junction of the two seas or continue for a long period."

source: فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله في البحر سربا
en: But when they reached the junction between them, they forgot their fish, and it took its course into the sea, slipping away.

source: فلما جاوزا قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا
en: So when they had passed beyond it, [Moses] said to his boy, "Bring us our morning meal. We have certainly suffered in this, our journey, [much] fatigue."

source: قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا
en: He said, "Did you see when we retired to the rock? Indeed, I forgot [there] the fish. And none made me forget it except Satan - that I should mention it. And it took its course into the sea amazingly".

source: قال ذلك ما كنا نبغ فارتدا على آثارهما قصصا
en: [Moses] said, "That is what we were seeking." So they returned, following their footprints.

source: فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما
en: And they found a servant from among Our servants to whom we had given mercy from us and had taught him from Us a [certain] knowledge.

source: قال له موسى هل أتبعك على أن تعلمن مما علمت رشدا
en: Moses said to him, "May I follow you on [the condition] that you teach me from what you have been taught of sound judgement?"

source: قال إنك لن تستطيع معي صبرا
en: He said, "Indeed, with me you will never be able to have patience.

source: وكيف تصبر على ما لم تحط به خبرا
en: And how can you have patience for what you do not encompass in knowledge?"

source: قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا
en: [Moses] said, "You will find me, if Allah wills, patient, and I will not disobey you in [any] order."

source: قال فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا
en: He said, "Then if you follow me, do not ask me about anything until I make to you about it mention."

source: فانطلقا حتى إذا ركبا في السفينة خرقها قال أخرقتها لتغرق أهلها لقد جئت شيئا إمرا
en: So they set out, until when they had embarked on the ship, al-Khidh r tore it open. [Moses] said, "Have you torn it open to drown its people? You have certainly done a grave thing."

source: قال ألم أقل إنك لن تستطيع معي صبرا
en: [Al-Khidh r] said, "Did I not say that with me you would never be able to have patience?"

source: قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا
en: [Moses] said, "Do not blame me for what I forgot and do not cover me in my matter with difficulty."

source: فانطلقا حتى إذا لقيا غلاما فقتله قال أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا
en: So they set out, until when they met a boy, al-Khidh r killed him. [Moses] said, "Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing."

source: قال ألم أقل لك إنك لن تستطيع معي صبرا
en: [Al-Khidh r] said, "Did I not tell you that with me you would never be able to have patience?"

source: قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا
en: [Moses] said, "If I should ask you about anything after this, then do not keep me as a companion. You have obtained from me an excuse."

source: فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه قال لو شئت لاتخذت عليه أجرا
en: So they set out, until when they came to the people of a town, they asked its people for food, but they refused to offer them hospitality. And they found therein a wall about to collapse, so al-Khidh r restored it. [Moses] said, "If you wished, you could have taken for it a payment."

source: قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا
en: [Al-Khidh r] said, "This is parting between me and you. I will inform you of the interpretation of that about which you could not have patience.

source: أما السفينة فكانت لمساكين يعملون في البحر فأردت أن أعيبها وكان وراءهم ملك يأخذ كل سفينة غصبا
en: As for the ship, it belonged to poor people working at sea. So I intended to cause defect in it as there was after them a king who seized every [good] ship by force.

source: وأما الغلام فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا
en: And as for the boy, his parents were believers, and we feared that he would overburden them by transgression and disbelief.

source: فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما
en: So we intended that their Lord should substitute for them one better than him in purity and nearer to mercy.

source: وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته كنز لهما وكان أبوهما صالحا فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن أمري ذلك تأويل ما لم تسطع عليه صبرا
en: And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience."

source: ويسألونك عن ذي القرنين قل سأتلو عليكم منه ذكرا
en: And they ask you, [O Muhammad], about Dhul-Qarnayn. Say, "I will recite to you about him a report."

source: إنا مكنا له في الأرض وآتيناه من كل شيء سببا
en: Indeed We established him upon the earth, and We gave him to everything a way.

source: فأتبع سببا
en: So he followed a way

source: حتى إذا بلغ مغرب الشمس وجدها تغرب في عين حمئة ووجد عندها قوما قلنا يا ذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنا
en: Until, when he reached the setting of the sun, he found it [as if] setting in a spring of dark mud, and he found near it a people. Allah said, "O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness."

source: قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا
en: He said, "As for one who wrongs, we will punish him. Then he will be returned to his Lord, and He will punish him with a terrible punishment.

source: وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا
en: But as for one who believes and does righteousness, he will have a reward of Paradise, and we will speak to him from our command with ease."
